/*
 * @discretion	: 基于jquery.validate插件的常用数据类型校验方法
 * @author    	: wandalong 
 * @version		: v1.0.0
 * @email     	: hnxyhcwdl1003@163.com
 */
;(function($){

	//循环配置；自动添加普通自定义方法
	$.each({
		// 只能是字母和数字的验证
		"chrnum"				: /^[a-zA-Z0-9]+$/,
	   	// 英文
		"english"				: /^[A-Za-z]+$/,
		// 匹配中文字符的正则表达式: 汉字 中国
		"chinese"				: /^[\u4e00-\u9fa5]+$/,
		//日期格式：1901-10-03 23:35
	   	"dateTime"				: /^\d{4}-\d{1,2}-\d{1,2}\s+([0-1][0-9]|2[0-3])(:{1}[0-5]{1}[0-9]{1}){1}$/,
		//日期格式：1901-10-03 23:35:26
		"dateTimeSecond"		: /^\d{4}-\d{1,2}-\d{1,2}\s+([0-1][0-9]|2[0-3])(:{1}[0-5]{1}[0-9]{1}){2}$/,
		// 验证值小数位数不能超过两位
		"decimal"				: /^-?\d+(\.\d{1,2})?$/,
		//匹配Email地址
		//^[a-z]([a-z0-9]*[-_]?[a-z0-9]+)*@([a-z0-9]*[-_]?[a-z0-9]+)+[\.][a-z]{2,3}([\.][a-z]{2})?$/i; 
		//regex:/^[a-z]([a-z0-9]*[-_]?[a-z0-9]+)*@([a-z0-9]*[-_]?[a-z0-9]+)+[\.][a-z]{2,3}([\.][a-z]{2})?$/i,
		//regex:/^((([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+(\.([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+)*)|((\x22)((((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(([\x01-\x08\x0b\x0c\x0e-\x1f\x7f]|\x21|[\x23-\x5b]|[\x5d-\x7e]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(\\([\x01-\x09\x0b\x0c\x0d-\x7f]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF]))))*(((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(\x22)))@((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?$/,
	   	//"email2"				: /^([a-z0-9]*[-_]?[a-z0-9]+)*@([a-z0-9]*[-_]?[a-z0-9]+)+[\.][a-z]{1,4}([\.][a-z]{2,4})?$/i,
		"email2"				: /^((([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+(\.([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+)*)|((\x22)((((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(([\x01-\x08\x0b\x0c\x0e-\x1f\x7f]|\x21|[\x23-\x5b]|[\x5d-\x7e]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(\\([\x01-\x09\x0b\x0c\x0d-\x7f]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF]))))*(((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(\x22)))@((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?$/,
		// 浮点数
	   	"float"					: /-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)/,
	   	//数字包括小数
	   	"floatNumber"			: /^(0|[1-9][0-9]*)(\.\d+)?$/,
	   	//4位以内非负正整数
	   	"fourInteger"			: /^([1-9][0-9]{0,3}|0)$/,
	   	//匹配18位身份证号
	   	"idCard" 				: /^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})([0-9]|X)$/,
	   	//整数
		"integer"				: /^-?(0|[1-9]\d*)$/,
		//字母开头，包含字母和下划线的字符
		"LetterNumberUnderline"	: /^[a-zA-Z][\w]+$/,
		// 匹配国内固定电话号码和11位手机号码
		"mobile"				: /^(?:(?:0\d{2,3}-\d{7,8})|\d{7,8}|1\d{10})$/,
		/*
	             三大运营商的号段汇总：
	   	1、中国移动：134、135、136、137、138、139、147（数据卡号段）、150、151、152、157（TD）、158、159、178（4G）、182、183、184、187、188、1380、1390、1705（虚拟运营商移动号段）
	   	2、中国联通：130、131、132、145(数据卡号段)、155、156、176（4G）、185、186、1707（虚拟运营商联通号段）、1708（虚拟运营商联通号段）、1709（虚拟运营商联通号段）
	   	3、中国电信：133、153、177（4G）、180、181、189、1349（卫通）、1700（虚拟运营商电信号段）、1701（虚拟运营商电信号段）
		备注：1、三大通信运营商推出4G号码段中国联通176，电信177，移动178号码
			2、170号段不是移动的，也不是联通的，而是电信的号段，并且是虚拟运营商。
		 	3、虚拟运营商：是指拥有某种或者某几种能力与电信运营商在某项业务或者某几项业务上形成合作关系的合作伙伴，电信运营商按照一定的利益分成比例，
		 			把业务交给虚拟运营商去发展，其自身则腾出力量去做最重要的工作，同时电信运营商自己也在直接发展用户。
		 
		 所有的号码段分类：			
		 	130、131、132、133、 134、135、136、137、138、139
		 	145(数据卡号段)、147（数据卡号段）
		 	150、151、152、153、 155、156、157（TD）、158、159
		 	176（4G）、177（4G）、178（4G）
		 	180、181、182、183、184、185、186、187、188、189
		 	1349（卫通）、1380、1390
		 	1700（虚拟运营商电信号段）、1701（虚拟运营商电信号段）、1705（虚拟运营商移动号段）、1707（虚拟运营商联通号段）、1708（虚拟运营商联通号段）、1709（虚拟运营商联通号段）
		*/
	   	"mobileCN" 				: /^1(?:(?:3\d|4[57]|5[0-35-9]|7[6-8]|8\d)\d{8}|3(?:49|80|90)\d{7}|70[015789]\d{7})$/,
		/*
	     * 中国移动：CMCC ( China Mobile Communication Corporation )
	     * 134、135、136、137、138、139、147（数据卡号段）、150、151、152、157（TD）、158、159、178（4G）、182、183、184、187、188、1380、1390、1705（虚拟运营商移动号段）
	     */
	   	"mobileCMC"				: /^1(?:(?:3[4-9]|4[7]|5[0-27-9]|7[8]|8[2-478])\d{8}|705\d{7}|3[89]0\d{7})$/,
		/*
	     * 中国联通：CUT ( China United Telecommunications )
	     * 130、131、132、145(数据卡号段)、155、156、176（4G）、185、186、1707（虚拟运营商联通号段）、1708（虚拟运营商联通号段）、1709（虚拟运营商联通号段）
	     */
		"mobileCUT"				: /^1(?:(?:3[0-2]|4[5]|5[56]|7[6]|8[56])\d{8}|70[7-9]\d{7})$/,
		/*
	     * 中国电信：CTC (China Telecom Corporation)
	     * 133、153、177（4G）、180、181、189、（1349卫通）、1700（虚拟运营商电信号段）、1701（虚拟运营商电信号段）
	     */
		"mobileCTC"				: /^1(?:(?:33|53|77|8[019])\d{8}|70[01]\d{7})$/,
		//负整数
		"NegativeInteger"		: /^-[1-9]\d*$/,
		//负浮点数
		"NegativeFloat"			: /^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$/,
		//匹配1开头的11位电话号码，仅验证数字和长度
	   	"phone"					: /^1\d{10}$/,
	   	//拼音字母
	   	"pingyin"				: /^[A-Za-z\s\.\·]+$/,
		"positiveNumber"		: /^(([1-9]+[0-9]*.{1}[0-9]+)|([0].{1}[1-9]+[0-9]*)|([1-9][0-9]*)|([0][.][0-9]+[1-9]*))|0?\.0+|0$/,
		//正整数
		"PositiveInteger"		: /^[1-9]\d*$/,
		//正整数+小数
		"positiveIntegerFloat"	: /^[1-9]\d*|[1-9]\d*\.\d*|0\.\d*[1-9]\d*$/,
		//正浮点数
	   	"PositiveFloat"			: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$/,
	   	// 匹配国内固定电话号码 , 匹配形式如 0511-4405222 或 021-87888822
	   	"tel"					: /^(?:(?:0\d{2,3}-\d{7,8})|\d{7,8})$/, 
		//[0-2]3位数字组合
		"ThreeNum"				: /^[0-2]{3}$/,
		//非负整数（正整数 + 0）
		"UnNegativeInteger"		: /^[1-9]\d*|0$/,
		//非正整数（负整数 + 0）
		"UnPositiveInteger"		: /^-[1-9]\d*|0$/,
		//非负浮点数（正浮点数 + 0）
		"UnNegativeFloat"		: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$/,
		//网站地址
		"url2"					: /^(https?|ftp):\/\/(((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:)*@)?(((\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5]))|((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?)(:\d*)?)(\/((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)+(\/(([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)*)*)?)?(\?((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)|[\uE000-\uF8FF]|\/|\?)*)?(\#((([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(%[\da-f]{2})|[!\$&'\(\)\*\+,;=]|:|@)|\/|\?)*)?$/,
		// 字符验证
		"words"					: /^[\u0391-\uFFE5\w]+$/,
		//学分验证，可以为0
		"xfPositiveInteger"		: /^((0\.5)|([0-9][0-9]*((\.0)|(\.5))?)|0)$/,
		//周学时验证
		"zhxsPositiveInteger"	: /^((0\.5)|([1-9][0-9]*((\.0)|(\.5))?))$/,
	   	// 邮政编码验证
	   	"zipCode"				: /^[0-9]\d{5}(?!\d)$/,
		//照片像素
		"zpxs"					: /^\d+\*\d+$/,
	},function(name,regex){
		$.validator.addMethod(name, function(value, element, param) {
			return this.optional(element) || (regex.test(value));
		});
	});

	// 工信部已向三大运营商分配的号码段手机号码/固定电话 综合验证
	$.validator.addMethod("mobileASGN", function(value, element, param) {
		var isOk = true;
		if($.trim(value).length>0){
			isOk = (regexs.tel.regex.test(value)) (regexs.mobileCN.regex.test(value));
		}
		return  this.optional(element) || isOk;
	});
	 
}(jQuery));